name: "codegen"
backend: "python"
max_batch_size: 4

input [
  {
    name: "prompts"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "completions"
    data_type: TYPE_STRING
    dims: [ 1, 1 ]
  }
]

instance_group [
  {
      count: 1
      kind: GPU
  }
]