name: "postprocessing"
backend: "python"
max_batch_size: 128
dynamic_batching { }

input [
  {
    name: "TOKENS_BATCH"
    data_type: TYPE_UINT32
    dims: [ -1, -1 ]
  },
  {
    name: "REQUEST_INPUT_LEN"
    data_type: TYPE_UINT32
    dims: [ 1 ]
  }
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [ -1, -1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]